Revit 2017 API
ShapeImporter Members
The ShapeImporter type exposes the following members.
Constructors
Name | Description
ShapeImporter
 Default constructor. Initializes an instance of ShapeImporter that will automaticall?y recognize the file format from its extension (ShapeImporterSourceFormat.Auto).
Methods
Name | Description
Convert
 Converts the geometry stored in the external format into a collection of Revit geometry objects.
Dispose
Releases all resources used by the ShapeImporter
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
IsServiceAvailable
 Checks whether the data conversion service is available.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
Properties
Name | Description
InputFormat
 The format of the incoming data.
IsValidObject
 Specifies whether the .NET object represents a valid Revit entity.
See Also
ShapeImporter Class
Autodesk.Revit.DB Namespace